---
type: CurveArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CurveArray

`Autodesk.Revit.DB.CurveArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CurveArray | — | `public CurveArray ()` |
| Method | Append | — | `public virtual void Append ( Curve item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual CurveArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Curve item , int index )` |
| Method | ReverseIterator | — | `public virtual CurveArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Curve this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |